d = {
    '1': ['1', '2', '4'],
    '2': ['1', '2', '3', '5'],
    '3': ['2', '3', '6'],
    '4': ['1', '4', '5', '7'],
    '5': ['2', '5', '4', '6', '8'],
    '6': ['3', '5', '6', '9'],
    '7': ['4', '7', '8'],
    '8': ['5', '7', '8', '9', '0'],
    '9': ['6', '8', '9'],
    '0': ['8', '0'],
}

def get_pins(o):
    if len(o) == 1:
        return d[o]
    res = []
    first = d[o[0]]
    next = get_pins(o[1:])
    for var in first:
        for nextpin in next:
            res.append(var + nextpin)
    return res

# Пример использования:
pins = get_pins('12')
print(pins)














print(get_pins('8'),'\n',['5','7','8','9','0'])
print()
print(get_pins('11'),'\n' ,["11", "22", "44", "12", "21", "14", "41", "24", "42"])